<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# <center> Проект: Анализ вакансий из HeadHunter

In [280]:
import pandas as pd
import psycopg2
import requests
from bs4 import BeautifulSoup

In [281]:
# вставьте сюда параметры подключения из юнита 1. Работа с базой данных из Python 
DBNAME = 'project_sql'
USER = 'skillfactory'
PASSWORD = 'cCkxxLVrDE8EbvjueeMedPKt'
HOST = '84.201.134.129'
PORT = 5432

In [282]:
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
)

# Юнит 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в нашей базе (вакансии находятся в таблице vacancies).

In [52]:
# текст запроса
query_3_1 = f'''select count(v.name)
                from public.vacancies v
                
'''

In [23]:
# результат запроса
df_vacancies = pd.read_sql_query(query_3_1, connection)
df_vacancies

C:\Users\Анечка\AppData\Local\Temp\ipykernel_33972\1490257461.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_vacancies = pd.read_sql_query(query_3_1, connection)

   count
0  49197

2. Напишите запрос, который посчитает количество работодателей (таблица employers).

In [21]:
# текст запроса
query_3_2 = f'''select count(e.name)
                from public.employers e
                
'''

In [24]:
# результат запроса
df_employers = pd.read_sql_query(query_3_2, connection)
df_employers

C:\Users\Анечка\AppData\Local\Temp\ipykernel_33972\3337367508.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_employers = pd.read_sql_query(query_3_2, connection)

   count
0  23501

3. Посчитате с помощью запроса количество регионов (таблица areas).

In [25]:
# текст запроса
query_3_3 = f'''select count(a.name)
                from public.areas a
                
'''

In [26]:
# результат запроса
df_areas = pd.read_sql_query(query_3_3, connection)
df_areas

C:\Users\Анечка\AppData\Local\Temp\ipykernel_33972\2360458281.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_areas = pd.read_sql_query(query_3_3, connection)

   count
0   1362

4. Посчитате с помощью запроса количество сфер деятельности в базе (таблица industries).

In [27]:
# текст запроса
query_3_4 = f'''select count(i.name)
                from public.industries i
                
'''

In [28]:
# результат запроса
df_industries = pd.read_sql_query(query_3_4, connection)
df_industries

C:\Users\Анечка\AppData\Local\Temp\ipykernel_33972\1986887719.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_industries = pd.read_sql_query(query_3_4, connection)

   count
0    294

In [299]:
# Какие вакансии встречаются чаще всего
query_3_5=f'''select distinct v.name, 
                    count(v.id)
            from public.vacancies v
            group by v.name
            order by 2 desc
            limit 10
'''

In [300]:
number_vacancies= pd.read_sql_query(query_3_5, connection)
number_vacancies

C:\Users\Анечка\AppData\Local\Temp\ipykernel_32004\3221911251.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  number_vacancies= pd.read_sql_query(query_3_5, connection)

                               name  count
0           Системный администратор   1761
1                    Программист 1С   1153
2                   Бизнес-аналитик    488
3  Специалист технической поддержки    457
4                Системный аналитик    432
5                          Аналитик    404
6               Инженер-программист    389
7                    Программист 1C    360
8              Frontend-разработчик    242
9     Инженер технической поддержки    230

***

In [ ]:
# выводы по предварительному анализу данных
Представленных вакансий чуть больше 49 тысяч, работодателей - более 23 тысяч. Можно сказать, что в среднем один работодатель предлагает две вакансии. Отметим большое разнообразие регионов (1362) и сфер деятельности компаний (294).
В топ-10 наиболее популярных вакансий специалистов DS нет (в первой тройке системный администратор, программист 1С и бизнес-аналитик). Программист 1С появляется в десятке дважды, судя по всему, это связано с формой записи данных.

# Юнит 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Отсортируйте по количеству вакансий в порядке убывания.

In [42]:
# текст запроса
query_4_1 = f'''select count(v.name),
                       a.name
                from public.vacancies v
                join public.areas a on a.id = v.area_id
                group by a.id
                order by count(v.name) desc
                
'''

In [43]:
# результат запроса
df_cnt_vac = pd.read_sql_query(query_4_1, connection)
df_cnt_vac

C:\Users\Анечка\AppData\Local\Temp\ipykernel_33972\3916308190.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_cnt_vac = pd.read_sql_query(query_4_1, connection)

     count                      name
0     5333                    Москва
1     2851           Санкт-Петербург
2     2112                     Минск
3     2006               Новосибирск
4     1892                    Алматы
..     ...                       ...
764      1                    Кизляр
765      1                    Джизак
766      1                    Эртиль
767      1                  Арсеньев
768      1  Тура (Красноярский край)

[769 rows x 2 columns]

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [ ]:
# текст запроса
query_4_2 = f'''select count(*)
            
               from public.vacancies v
               where v.salary_from is not null or v.salary_to is not null
               
'''

In [61]:
# результат запроса
df_not_null_salary = pd.read_sql_query(query_4_2, connection)
df_not_null_salary

C:\Users\Анечка\AppData\Local\Temp\ipykernel_33972\3461170801.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_not_null_salary = pd.read_sql_query(query_4_2, connection)

   count
0  24073

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого.

In [ ]:
# текст запроса
query_4_3 =f'''select avg(v.salary_from),
                      avg(v.salary_to)
            
               from public.vacancies v
               where v.salary_from is not null or v.salary_to is not null
               
'''

In [64]:
# результат запроса
df_avg_salary = pd.read_sql_query(query_4_3, connection)
df_avg_salary

C:\Users\Анечка\AppData\Local\Temp\ipykernel_33972\4289725438.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_avg_salary = pd.read_sql_query(query_4_3, connection)

            avg            avg
0  71064.657901  110536.741923

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [ ]:
# текст запроса
query_4_4 = f'''select count(v.name),
                      v.schedule,
                      v.employment
                from public.vacancies v
                group by v.schedule, v.employment
                order by 1 desc
'''

In [88]:
# результат запроса
df_1 = pd.read_sql_query(query_4_4, connection)
df_1

C:\Users\Анечка\AppData\Local\Temp\ipykernel_33972\3348690913.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_1 = pd.read_sql_query(query_4_4, connection)

    count          schedule           employment
0   35367       Полный день     Полная занятость
1    7802  Удаленная работа     Полная занятость
2    1593     Гибкий график     Полная занятость
3    1312  Удаленная работа  Частичная занятость
4     940    Сменный график     Полная занятость
5     569       Полный день           Стажировка
6     367    Вахтовый метод     Полная занятость
7     347       Полный день  Частичная занятость
8     312     Гибкий график  Частичная занятость
9     141       Полный день     Проектная работа
10    133  Удаленная работа     Проектная работа
11    116     Гибкий график           Стажировка
12    101    Сменный график  Частичная занятость
13     64  Удаленная работа           Стажировка
14     18     Гибкий график     Проектная работа
15     12    Сменный график           Стажировка
16      2    Вахтовый метод     Проектная работа
17      1    Сменный график     Проектная работа

5. Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [ ]:
# текст запроса
query_4_5 = f'''select v.experience,
                      count(v.name)
                from public.vacancies v
                group by v.experience
                order by 2
'''

In [90]:
# результат запроса
df_experience = pd.read_sql_query(query_4_5, connection)
df_experience

C:\Users\Анечка\AppData\Local\Temp\ipykernel_33972\1343279108.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_experience = pd.read_sql_query(query_4_5, connection)

           experience  count
0         Более 6 лет   1337
1           Нет опыта   7197
2       От 3 до 6 лет  14511
3  От 1 года до 3 лет  26152

***

In [ ]:
# выводы по детальному анализу вакансий
Зарплата указана у менее половины вакансий. Наибольшее число вакансий предполагают полный день/полную занятость, хотя кажется, что IT вакансии во многом удаленная работа.  Наибольшее количество предложенных вакансий находятся в городах миллионниках. Вариантов стажировок и проектной работы среди вакансий относительно немного. Так же следует отметить, что почти половина вакансий требует достаточно небольшой опыт работы, от 1 до 3 лет.

# Юнит 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [ ]:
# текст запроса
query_5_1 = f'''(select count(v.name),
                      e.name
               from public.vacancies v
               join public.employers e on e.id=v.employer_id 
               group by e.name
               order by 1 desc
               limit  1)
               union all
               (select count(v.name),
                      e.name
               from public.vacancies v
               join public.employers e on e.id=v.employer_id 
               group by e.name
               order by 1 desc
               offset 4 
               limit  1)
               
'''

In [108]:
# результат запроса
df_employers_vac = pd.read_sql_query(query_5_1, connection)
df_employers_vac

C:\Users\Анечка\AppData\Local\Temp\ipykernel_33972\1084932256.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_employers_vac = pd.read_sql_query(query_5_1, connection)

   count           name
0   1933         Яндекс
1    331  Газпром нефть

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [321]:
# текст запроса
query_5_2 = f'''select a.name area,
                      count(distinct e.name) employers,
                      count(distinct v.name) vacancion
               from public.areas a
               left join public.vacancies v on a.id=v.area_id
               left join public.employers e on a.id=e.area
               where v.id is null
               group by a.id
               order by 2 desc
              limit 1
'''

In [322]:
# результат запроса
df_area_emp_vac = pd.read_sql_query(query_5_2, connection)
df_area_emp_vac

C:\Users\Анечка\AppData\Local\Temp\ipykernel_32004\1298065709.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_area_emp_vac = pd.read_sql_query(query_5_2, connection)

     area  employers  vacancion
0  Россия        410          0

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [ ]:
# текст запроса
query_5_3 = f'''select e.name,
                      count(distinct a.name)
            from public.vacancies v
            left join public.employers e on v.employer_id=e.id
            left join public.areas a on v.area_id=a.id
            group by e.name
            order by 2 desc
'''

In [163]:
# результат запроса
df_emp_area_vac = pd.read_sql_query(query_5_3, connection)
df_emp_area_vac

C:\Users\Анечка\AppData\Local\Temp\ipykernel_33972\901755791.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_emp_area_vac = pd.read_sql_query(query_5_3, connection)

                         name  count
0                      Яндекс    181
1                  Ростелеком    152
2                  Спецремонт    116
3      Поляков Денис Иванович     88
4                   ООО ЕФИН      71
...                       ...    ...
14761                  UniSol      1
14762            UNISTORY LLC      1
14763                   UNIT6      1
14764     United Distribution      1
14765              UNITEL LLC      1

[14766 rows x 2 columns]

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [ ]:
# текст запроса
query_5_4 =f'''select count(e.id) employers_count
              from public.employers e
              left join public.employers_industries ei on ei.employer_id=e.id
              
              where ei.employer_id is null
'''

In [188]:
# результат запроса
df_emp=pd.read_sql_query(query_5_4, connection)
df_emp

C:\Users\Анечка\AppData\Local\Temp\ipykernel_33972\3979418472.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_emp=pd.read_sql_query(query_5_4, connection)

   employers_count
0             8419

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [ ]:
# текст запроса
query_5_5 = f'''select e.name

               from public.employers e
               left join public.employers_industries ei on ei.employer_id=e.id
               
               group by e.name
               having count(ei.industry_id)=4
               order by 1
               offset 2 limit 1
'''

In [207]:
# результат запроса
df_emp_ind = pd.read_sql_query(query_5_5, connection)
df_emp_ind

C:\Users\Анечка\AppData\Local\Temp\ipykernel_33972\2543591559.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_emp_ind = pd.read_sql_query(query_5_5, connection)

   name
0  2ГИС

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана Разработка программного обеспечения.

In [ ]:
# текст запроса
query_5_6 = f'''select count(e.id)
                      
               from public.employers e
               left join public.employers_industries ei on ei.employer_id=e.id
               left join public.industries i on ei.industry_id=i.id
               where i.name='Разработка программного обеспечения'

'''

In [226]:
# результат запроса
df_empl_po = pd.read_sql_query(query_5_6, connection)
df_empl_po

C:\Users\Анечка\AppData\Local\Temp\ipykernel_33972\2035619631.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_empl_po = pd.read_sql_query(query_5_6, connection)

   count
0   3553

7. Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

Список городов-милионников надо взять [отсюда](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8). 

Если возникнут трудности с этим задание посмотрите материалы модуля  PYTHON-17. Как получать данные из веб-источников и API.

In [5]:
# код для получения списка городов-милионников
url = 'https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8'
response = requests.get(url)
table = pd.read_html(url, match='Город')[0]
cities_list = list(table['Город'])
cities_list = tuple([w for w in cities_list if w.strip()])
print(cities_list)

('Москва', 'Санкт-Петербург', 'Новосибирск', 'Екатеринбург', 'Казань', 'Красноярск', 'Нижний Новгород', 'Челябинск', 'Уфа', 'Краснодар', 'Самара', 'Ростов-на-Дону', 'Омск', 'Воронеж', 'Пермь', 'Волгоград')

In [ ]:
# текст запроса
query_5_7 = f'''(select a.name,
                      count(v.id)
                      
               from public.vacancies v
               join public.areas a on a.id = v.area_id
               join public.employers e on e.id = v.employer_id
               where e.name='Яндекс' and a.name in ('Москва', 'Санкт-Петербург', 'Новосибирск', 'Екатеринбург', 'Казань', 'Красноярск', 'Нижний Новгород', 'Челябинск', 'Уфа', 'Краснодар', 'Самара', 'Ростов-на-Дону', 'Омск', 'Воронеж', 'Пермь', 'Волгоград') 
               group by a.name
               )
               union all
               (select 'Total',
                       count(v.id) 
                      
              from public.vacancies v
               join public.areas a on a.id = v.area_id
               join public.employers e on e.id = v.employer_id
               where e.name='Яндекс' and a.name in ('Москва', 'Санкт-Петербург', 'Новосибирск', 'Екатеринбург', 'Казань', 'Красноярск', 'Нижний Новгород', 'Челябинск', 'Уфа', 'Краснодар', 'Самара', 'Ростов-на-Дону', 'Омск', 'Воронеж', 'Пермь', 'Волгоград'))
               order by 2

'''

In [38]:
# результат запроса
yandex_areas = pd.read_sql_query(query_5_7, connection)
yandex_areas

C:\Users\Анечка\AppData\Local\Temp\ipykernel_32004\3328424714.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  yandex_areas = pd.read_sql_query(query_5_7, connection)

               name  count
0              Омск     21
1         Челябинск     22
2        Красноярск     23
3         Волгоград     24
4             Пермь     25
5            Казань     25
6    Ростов-на-Дону     25
7               Уфа     26
8            Самара     26
9         Краснодар     30
10          Воронеж     32
11      Новосибирск     35
12  Нижний Новгород     36
13     Екатеринбург     39
14  Санкт-Петербург     42
15           Москва     54
16            Total    485

***

In [ ]:
# выводы по анализу работодателей
Лидер по колличеству вакансий  - это "Яндекс": он предлагает больше всего вакансий в самом большом числе регионов. Также в топе находятся другие широко известные компании: Ростелеком, Тинькофф, Сбер, Газпром и так далее.

# Юнит 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'.

*Подсказка: Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [ ]:
# текст запроса
query_6_1 = f'''select count(v.name)
                      
            from public.vacancies v
            
            where lower(v.name) like '%data%' or lower(v.name) like '%данн%'
'''

In [47]:
# результат запроса
data_vacancies = pd.read_sql_query(query_6_1, connection)
data_vacancies

C:\Users\Анечка\AppData\Local\Temp\ipykernel_32004\2935617630.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  data_vacancies = pd.read_sql_query(query_6_1, connection)

   count
0   1771

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? 
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* 'data scientist'
* 'data science'
* 'исследователь данных'
* 'ML' (здесь не нужно брать вакансии по HTML)
* 'machine learning'
* 'машинн%обучен%'

** В следующих заданиях мы продолжим работать с вакансиями по этому условию.*

Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово 'junior' *или*
* требуемый опыт — Нет опыта *или*
* тип трудоустройства — Стажировка.

In [278]:
# текст запроса
query_6_2 = f'''select count(*) cnt
                      
            from public.vacancies v
            
            where 
                (lower(v.name) like '%data scientist%' 
                or lower(v.name) like '%data science%'
                or lower(v.name) like '%исследователь данных%' 
                or ((lower(v.name) like lower('%ML%')) and (lower(v.name) not like lower('%HTML%')))
                or lower(v.name) like '%machine learning%'
                or lower(v.name) like '%машинн%обучен%')
            and ((lower(v.name) like '%junior%')
                 or (v.experience ='Нет опыта') 
                 or (v.employment ='Стажировка'))
'''

In [279]:
# результат запроса
junior_vacancies = pd.read_sql_query(query_6_2, connection)
junior_vacancies

C:\Users\Анечка\AppData\Local\Temp\ipykernel_32004\625073081.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  junior_vacancies = pd.read_sql_query(query_6_2, connection)

   cnt
0   51

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

** Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [ ]:
# текст запроса
query_6_3 = f'''select count(*) cnt
                      
            from public.vacancies v
            
           where 
                (lower(v.name) like '%data scientist%' 
                or lower(v.name) like '%data science%'
                or lower(v.name) like '%исследователь данных%' 
                 or ((lower(v.name) like lower('%ML%')) and (lower(v.name) not like lower('%HTML%'))) 
                or lower(v.name) like '%machine learning%'
                or lower(v.name) like '%машинн%обучен%')
                
           and (lower(v.key_skills) like '%postgres%' or lower(v.key_skills) like '%sql%')
                   
'''

In [277]:
# результат запроса
sql_postgres_skills = pd.read_sql_query(query_6_3, connection)
sql_postgres_skills

C:\Users\Анечка\AppData\Local\Temp\ipykernel_32004\4029438776.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  sql_postgres_skills = pd.read_sql_query(query_6_3, connection)

   cnt
0  229

4. Проверьте, насколько популярен Python в требованиях работодателей к DS.Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

** Это можно сделать помощью запроса, аналогичного предыдущему.*

In [ ]:
# текст запроса
query_6_4 = f'''select count(v.name) cnt
                      
            from public.vacancies v
            
            where 
                (lower(v.name) like '%data scientist%' 
                or lower(v.name) like '%data science%'
                or lower(v.name) like '%исследователь данных%' 
                 or ((v.name ilike '%ML%') and (v.name not ilike '%HTML%'))
                or lower(v.name) like '%machine learning%'
                or lower(v.name) like '%машинн%обучен%')
            and lower(v.key_skills) like lower('%Python%') 
'''

In [273]:
# результат запроса
python_skills = pd.read_sql_query(query_6_4, connection)
python_skills

C:\Users\Анечка\AppData\Local\Temp\ipykernel_32004\950132531.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  python_skills = pd.read_sql_query(query_6_4, connection)

   cnt
0  357

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?
Ответ округлите до двух знаков после точки-разделителя.

In [ ]:
# текст запроса
# Ключевые навыки в каждой строке разделены символами табуляции, поэтому мы заменим этот символ пустой строкой (по сути удалим)
# Далее вычтем из полной строки получившуются сокращенную строку и прибавим 1 (так как один символ разделяет два навыка)
query_6_5 = f'''select 
                       round(avg(1+(length(v.key_skills) - length(coalesce(replace(v.key_skills, CHR(9), ''))))), 2)
            from public.vacancies v
            where 
                (lower(v.name) like '%data scientist%' 
                or lower(v.name) like '%data science%'
                or lower(v.name) like '%исследователь данных%' 
                or (v.name like '%ML%' and v.name not like '%HTML%') 
                or lower(v.name) like '%machine learning%'
                or lower(v.name) like '%машинн%обучен%') 
            and (v.key_skills) is not null 
           
                
'''

In [112]:
# результат запроса
skills=pd.read_sql_query(query_6_5, connection)
skills

C:\Users\Анечка\AppData\Local\Temp\ipykernel_32004\1082348095.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  skills=pd.read_sql_query(query_6_5, connection)

   round
0   6.41

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в **среднем** указывают для каждого типа требуемого опыта (уникальное значение из поля *experience*). 

При решении задачи примите во внимание следующее:
1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
3. Если в расчётах участвует null, в результате он тоже даст null (посмотрите, что возвращает запрос select 1 + null). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит null на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до целого числа.

In [ ]:
# текст запроса
query_6_6 = f'''select  
                        v.experience,
                       ROUND(AVG(coalesce((salary_from+salary_to)/2, salary_from, salary_to)), 0)
                       
            from public.vacancies v
            where 
                (lower(v.name) like '%data scientist%' 
                or lower(v.name) like '%data science%'
                or lower(v.name) like '%исследователь данных%' 
                or (v.name like '%ML%' and v.name not like '%HTML%') 
                or lower(v.name) like '%machine learning%'
                or lower(v.name) like '%машинн%обучен%') 
                and
                (v.salary_from is not null or v.salary_to is not null)
            group by v.experience
                
'''

In [263]:
# результат запроса
avg_salary=pd.read_sql_query(query_6_6, connection)
avg_salary

C:\Users\Анечка\AppData\Local\Temp\ipykernel_32004\3605955135.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  avg_salary=pd.read_sql_query(query_6_6, connection)

           experience     round
0           Нет опыта   74643.0
1  От 1 года до 3 лет  139675.0
2       От 3 до 6 лет  243115.0

***

In [ ]:
# выводы по предметному анализу
Всего вакансий, которыйе относятся с работой с данными - 1771, эот 3,5% от общего числа вакансий. При этом вакансий для начинающего дата-сайентиста всего 51. В зарплатах мы наблюдаем наибольший разрыв между неопытными сотрудниками и теми, чей опыт - от 1 до 3 лет. Имея средний опыт, можно получать почти вдвое большую зарплату, чем на начальном уровне. Зарплатный разрыв между сотрудниками со средним и большим (более 3 лет) опытом также велик: около 140к и примерно 243к. 
Ключевых навыков, которые ожидают работодатели, в среднем 6, причем весьма популярен Python - его требуют в чуть более 20% вакансий. SQL менее популярен, его ожидают примерно в 13% вакансий.

# Общий вывод по проекту

In [335]:
# подведем итог исследования, обобщите выводы
# здесь можно (это будет плюсом) провести дополнительные исследования данных, сделать прогнозы, продумать варианты продолжения исследования
# В качестве дополнительного исследования давайте посмотрим, в каких городах есть вакансии DS
query_7_1 = f'''select count(v.id) cnt,
                       a.name area
                      
            from public.areas a
            join public.vacancies v on a.id=v.area_id
            
            where 
                (lower(v.name) like '%data scientist%' 
                or lower(v.name) like '%data science%'
                or lower(v.name) like '%исследователь данных%' 
                 or ((v.name ilike '%ML%') and (v.name not ilike '%HTML%'))
                or lower(v.name) like '%machine learning%'
                or lower(v.name) like '%машинн%обучен%')
            
            group by a.name 
            order by cnt desc
'''

In [336]:
# результат запроса
ds_area=pd.read_sql_query(query_7_1, connection)
ds_area

C:\Users\Анечка\AppData\Local\Temp\ipykernel_32004\2674734050.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  ds_area=pd.read_sql_query(query_7_1, connection)

    cnt                       area
0   225                     Москва
1    69            Санкт-Петербург
2    23                Новосибирск
3    22                     Алматы
4    20            Нижний Новгород
5    19                     Казань
6    11                      Томск
7    11             Ростов-на-Дону
8    11                      Минск
9     8                      Пермь
10    7               Екатеринбург
11    7                 Нур-Султан
12    7                  Краснодар
13    6                     Самара
14    6                     Рязань
15    6                    Армения
16    5                       Кипр
17    4                    Воронеж
18    4                    Тбилиси
19    4                    Ташкент
20    4                        Уфа
21    4                Владивосток
22    3                  Иннополис
23    3                     Сербия
24    3                       Омск
25    2                      Чехия
26    2                       Баку
27    2                    Барнаул
28    2                    Вологда
29    2                     Ижевск
30    2                    Израиль
31    2  Киров (Кировская область)
32    2                      Литва
33    2                      Пенза
34    2                       Тула
35    2                     Турция
36    1                  Череповец
37    1                     Липецк
38    1               Петрозаводск
39    1                     Польша
40    1                 Красноярск
41    1                    Королев
42    1                Калининград
43    1                 Зеленоград
44    1                    Саратов
45    1                  Волгоград
46    1                     Брянск
47    1                     Бишкек
48    1                      Тверь
49    1                   Белгород
50    1                 Черногория
51    1                    Абхазия
52    1                     Тюмень
53    1                     Батуми
54    1                  Челябинск
55    1           Набережные Челны
56    1               Магнитогорск
57    1                       Орел

In [348]:
query_7_2 = f'''select count(v.id) cnt,
                       v.schedule
                      
            from public.vacancies v 
            
            where 
                v.schedule = 'Удаленная работа'
                and (lower(v.name) like '%data scientist%' 
                or lower(v.name) like '%data science%'
                or lower(v.name) like '%исследователь данных%' 
                 or ((v.name ilike '%ML%') and (v.name not ilike '%HTML%'))
                or lower(v.name) like '%machine learning%'
                or lower(v.name) like '%машинн%обучен%')
            
            group by  v.schedule
            order by cnt desc
'''

In [349]:
# результат запроса
ds_schedule=pd.read_sql_query(query_7_2, connection)
ds_schedule

C:\Users\Анечка\AppData\Local\Temp\ipykernel_32004\2949844443.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  ds_schedule=pd.read_sql_query(query_7_2, connection)

   cnt          schedule
0  129  Удаленная работа

In [ ]:
Одназначным лидером по количеству DS вакансий является Москва, с огромным отрывом от нее идут Санкт-Петербург, Новосибирск, Нижний Новогород и другие города России и ближнего зарубежья.
В целом шансы найти работу в области DS значительно зависят от региона проживания соискателя (или его готовности переехать).

специальность 'Data science' однозначно не является наиболее популярной среди других it-специальностей в данной базе данных, можно сказать, что работа в этой области есть как для начинающих, так и для опытных дата сайентистов. При этом наличие хотя бы одного года работы значительно увеличивает число подходящих вакансий. 
Распределение вакансий по регионам предсказуемо: лучше всего искать работу в Москве. Варианты удаленной работы составляют 7.2% от общего числа вакансий связанных с данными.